package jdbc.ex;

public class Ex05 {
    public static void main(String[] args) {

/*
        연습 문제 5. 사용자 정보 업데이트 활용

        사용자 ID를 입력하세요 : summer
        새 사용자 이름을 입력하세요 : 초여름
        새 비밀번호를 입력하세요 : 1234
        새 나이를 입력하세요 : 25
        새 이메일 주소를 입력하세요 : cho@summer.com
        사용자 ID summer의 정보가 성공적으로 업데이트되었습니다.

        사용자 ID를 입력하세요:summer
        새 사용자 이름을 입력하세요: 초여름
        새 비밀번호를 입력하세요: (사용자가 입력 없이 엔터)
        새 나이를 입력하세요: 25
        새 이메일 주소를 입력하세요: (사용자가 입력 없이 엔터)
        사용자 ID summer의 정보가 성공적으로 업데이트되었습니다.

        - 비밀번호와 이메일주소는 기존값을 유지
*/
    }
}
