package javadoc;

public class Ex00 {
    public static void main(String[] args) {

/*
        연습 문제 1. Java 수학 라이브러리 빌드하기

        - 작성한 수학 유틸리티 클래스 2개를 빌드하고 패키징하여 외부에서 사용할 수 있게 만들어주세요.
            - static0.ex.MathUtil
            - static0.ex.MathArrayUtil

        1. 새로운 프로젝트를 생성하세요.(MathLib)
        2. 위의 소스파일을 해당 프로젝트에 준비하세요.
        3. JavaDoc으로 해당 클래스에 대한 설명을 태그와 함께 작성해 보세요.
        4. JavaDoc을 사용해 API 문서를 만들어주세요.
        5. 빌드 단계를 거쳐 JAR 파일 아티팩트를 생성해 보세요.
        6. 다른 프로젝트에서 수학유틸리티 라이브러리 클래스를 불러와 사용해 보세요.

        ----------------------------------------------------------------------

        연습 문제 2. 실행 가능 컬렉션 주소록 관리 앱 빌드하기

        - 컬렉션 프레임워크 주소록 관리 자바 프로그램을 빌드하여 외부에서 JAR 파일로 실행해 보세요.
            - collection.list.ex.ex3.AddressBook;

        1. 새로운 프로젝트를 생성하세요. (AddressBook)
        2. 위 실행 가능 Java 파일과 관련된 클래스을 해당 프로젝트에 준비하세요.
        3. JavaDoc으로 해당 클래스에 대한 설명을 태그와 함께 작성해 보세요.
        4. JavaDoc을 사용해 API 문서를 만들어주세요.
        5. 빌드 단계를 거쳐 실행가능 JAR 파일 아티팩트를 생성해 보세요.
        6. 생성된 JAR 파일을 다른 경로로 옮겨 실행해 보세요.

        ----------------------------------------------------------------------

        연습 문제 3. DB 도서 관리 프로그램 앱 빌드하기

        - JDBC로 DB에 접근하여 CRUD를 수행하는 도서관리 프로그램을 빌드하여 외부에서 JAR 파일로 실행해 보세요.
            - package jdbc.ex.book;

        1. 새로운 프로젝트를 생성하세요.(BookManagement)
        2. 위 패키지와 관련된 클래스들을 해당 프로젝트에 준비하세요.
        3. JDBC 드라이버를 외부 라이브러리로 연결하세요.
        4. JavaDoc으로 해당 클래스에 대한 설명을 태그와 함께 작성해 보세요.
        5. JavaDoc을 사용해 API 문서를 만들어주세요.
        6. 빌드 단계를 거쳐 실행가능 JAR 파일 아티팩트를 생성해 보세요.
        7. 생성된 JAR 파일을 다른 경로로 옮겨 실행해 보세요.
*/
    }
}
